[Killed] BlockStatement
src/aggregator.ts:5:69
 import { dayKey } from './period';
 import { PricingOverrides, calcCost, defaultPricingOrder } from './pricing';
 
-export function addEvent(days: DayBuckets, event: UsageEvent): void {
-    const day = dayKey(event.timestamp);
-    const key = bucketKey(event.provider, event.model);
-    const bucket = (days[day] ??= {});
-    const usage = (bucket[key] ??= emptyUsage());
-    addUsage(usage, event.usage);
-}
+export function addEvent(days: DayBuckets, event: UsageEvent): void {}
 
 /** Drop buckets for days before minDay (inclusive keep). Returns true if anything was removed. */
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

0 !== 19

[Killed] AssignmentOperator
src/aggregator.ts:9:20
     const day = dayKey(event.timestamp);
     const key = bucketKey(event.provider, event.model);
     const bucket = (days[day] ??= {});
-    const usage = (bucket[key] ??= emptyUsage());
+    const usage = (bucket[key] &&= emptyUsage());
     addUsage(usage, event.usage);
 }
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Cannot read properties of undefined (reading 'input')

[Killed] BooleanLiteral
src/aggregator.ts:15:18
 
 /** Drop buckets for days before minDay (inclusive keep). Returns true if anything was removed. */
 export function pruneDaysBefore(days: DayBuckets, minDay: string): boolean {
-    let pruned = false;
+    let pruned = true;
     for (const day of Object.keys(days)) {
         if (day < minDay) {
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BlockStatement
src/aggregator.ts:16:42
 /** Drop buckets for days before minDay (inclusive keep). Returns true if anything was removed. */
 export function pruneDaysBefore(days: DayBuckets, minDay: string): boolean {
     let pruned = false;
-    for (const day of Object.keys(days)) {
-        if (day < minDay) {
-            delete days[day];
-            pruned = true;
-        }
-    }
+    for (const day of Object.keys(days)) {}
     return pruned;
 }
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/aggregator.ts:17:13
 export function pruneDaysBefore(days: DayBuckets, minDay: string): boolean {
     let pruned = false;
     for (const day of Object.keys(days)) {
-        if (day < minDay) {
+        if (false) {
             delete days[day];
             pruned = true;
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ConditionalExpression
src/aggregator.ts:17:13
 export function pruneDaysBefore(days: DayBuckets, minDay: string): boolean {
     let pruned = false;
     for (const day of Object.keys(days)) {
-        if (day < minDay) {
+        if (true) {
             delete days[day];
             pruned = true;
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

+ []
- [
-   '2026-07-01',
-   '2026-07-02'
- ]

[Killed] BooleanLiteral
src/aggregator.ts:19:22
     for (const day of Object.keys(days)) {
         if (day < minDay) {
             delete days[day];
-            pruned = true;
+            pruned = false;
         }
     }
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/aggregator.ts:55:55
 export function summarize(days: DayBuckets, today: string, overrides?: PricingOverrides): Record<Provider, ProviderSummary> {
     const rows = new Map<string, ModelRow & { provider: Provider }>();
     const monthCosts = new Map<string, { total: number; priced: boolean }>();
-    for (const [day, bucket] of Object.entries(days)) {
-        for (const [key, usage] of Object.entries(bucket)) {
-            const { provider, model } = parseBucketKey(key);
-            let row = rows.get(key);
-            if (!row) {
-                row = { provider, model, todayUsage: emptyUsage(), monthUsage: emptyUsage(), todayCost: undefined, monthCost: undefined };
-                rows.set(key, row);
-                monthCosts.set(key, { total: 0, priced: true });
-            }
-            addUsage(row.monthUsage, usage);
-            const dayCost = calcCost(model, usage, overrides, day);
-            const acc = monthCosts.get(key)!;
-            if (dayCost === undefined) {
-                acc.priced = false;
-            } else {
-                acc.total += dayCost;
-            }
-            if (day === today) {
-                addUsage(row.todayUsage, usage);
-            }
-        }
-    }
+    for (const [day, bucket] of Object.entries(days)) {}
     const result: Record<Provider, ProviderSummary> = {
         claude: { provider: 'claude', todayCost: 0, monthCost: 0, hasUnknownModel: false, models: [] },
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

0 !== 19

[Killed] BlockStatement
src/aggregator.ts:56:60
     const rows = new Map<string, ModelRow & { provider: Provider }>();
     const monthCosts = new Map<string, { total: number; priced: boolean }>();
     for (const [day, bucket] of Object.entries(days)) {
-        for (const [key, usage] of Object.entries(bucket)) {
-            const { provider, model } = parseBucketKey(key);
-            let row = rows.get(key);
-            if (!row) {
-                row = { provider, model, todayUsage: emptyUsage(), monthUsage: emptyUsage(), todayCost: undefined, monthCost: undefined };
-                rows.set(key, row);
-                monthCosts.set(key, { total: 0, priced: true });
-            }
-            addUsage(row.monthUsage, usage);
-            const dayCost = calcCost(model, usage, overrides, day);
-            const acc = monthCosts.get(key)!;
-            if (dayCost === undefined) {
-                acc.priced = false;
-            } else {
-                acc.total += dayCost;
-            }
-            if (day === today) {
-                addUsage(row.todayUsage, usage);
-            }
-        }
+        for (const [key, usage] of Object.entries(bucket)) {}
     }
     const result: Record<Provider, ProviderSummary> = {
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

0 !== 19

[Killed] ConditionalExpression
src/aggregator.ts:59:17
         for (const [key, usage] of Object.entries(bucket)) {
             const { provider, model } = parseBucketKey(key);
             let row = rows.get(key);
-            if (!row) {
+            if (true) {
                 row = { provider, model, todayUsage: emptyUsage(), monthUsage: emptyUsage(), todayCost: undefined, monthCost: undefined };
                 rows.set(key, row);
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

5 !== 19

[Killed] BooleanLiteral
src/aggregator.ts:62:57
             if (!row) {
                 row = { provider, model, todayUsage: emptyUsage(), monthUsage: emptyUsage(), todayCost: undefined, monthCost: undefined };
                 rows.set(key, row);
-                monthCosts.set(key, { total: 0, priced: true });
+                monthCosts.set(key, { total: 0, priced: false });
             }
             addUsage(row.monthUsage, usage);
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

0 !== 21.5

[Killed] BlockStatement
src/aggregator.ts:67:40
             addUsage(row.monthUsage, usage);
             const dayCost = calcCost(model, usage, overrides, day);
             const acc = monthCosts.get(key)!;
-            if (dayCost === undefined) {
-                acc.priced = false;
-            } else {
+            if (dayCost === undefined) {} else {
                 acc.total += dayCost;
             }
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/aggregator.ts:68:30
             const dayCost = calcCost(model, usage, overrides, day);
             const acc = monthCosts.get(key)!;
             if (dayCost === undefined) {
-                acc.priced = false;
+                acc.priced = true;
             } else {
                 acc.total += dayCost;
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/aggregator.ts:69:20
             const acc = monthCosts.get(key)!;
             if (dayCost === undefined) {
                 acc.priced = false;
-            } else {
-                acc.total += dayCost;
-            }
+            } else {}
             if (day === today) {
                 addUsage(row.todayUsage, usage);
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

0 !== 21.5

[Killed] AssignmentOperator
src/aggregator.ts:70:17
             if (dayCost === undefined) {
                 acc.priced = false;
             } else {
-                acc.total += dayCost;
+                acc.total -= dayCost;
             }
             if (day === today) {
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

-21.5 !== 21.5

[Killed] BlockStatement
src/aggregator.ts:72:32
             } else {
                 acc.total += dayCost;
             }
-            if (day === today) {
-                addUsage(row.todayUsage, usage);
-            }
+            if (day === today) {}
         }
     }
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

0 !== 19

[Killed] EqualityOperator
src/aggregator.ts:72:17
             } else {
                 acc.total += dayCost;
             }
-            if (day === today) {
+            if (day !== today) {
                 addUsage(row.todayUsage, usage);
             }
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

2 !== 19

[Killed] BooleanLiteral
src/aggregator.ts:78:84
         }
     }
     const result: Record<Provider, ProviderSummary> = {
-        claude: { provider: 'claude', todayCost: 0, monthCost: 0, hasUnknownModel: false, models: [] },
+        claude: { provider: 'claude', todayCost: 0, monthCost: 0, hasUnknownModel: true, models: [] },
         codex: { provider: 'codex', todayCost: 0, monthCost: 0, hasUnknownModel: false, models: [] },
     };
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BooleanLiteral
src/aggregator.ts:79:82
     }
     const result: Record<Provider, ProviderSummary> = {
         claude: { provider: 'claude', todayCost: 0, monthCost: 0, hasUnknownModel: false, models: [] },
-        codex: { provider: 'codex', todayCost: 0, monthCost: 0, hasUnknownModel: false, models: [] },
+        codex: { provider: 'codex', todayCost: 0, monthCost: 0, hasUnknownModel: true, models: [] },
     };
     for (const [key, row] of rows.entries()) {
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly deep-equal:
+ actual - expected
... Skipped lines

  {
    claude: {
      hasUnknownModel: false,
      models: [],

[Killed] BlockStatement
src/aggregator.ts:81:46
         claude: { provider: 'claude', todayCost: 0, monthCost: 0, hasUnknownModel: false, models: [] },
         codex: { provider: 'codex', todayCost: 0, monthCost: 0, hasUnknownModel: false, models: [] },
     };
-    for (const [key, row] of rows.entries()) {
-        row.todayCost = calcCost(row.model, row.todayUsage, overrides, today);
-        const acc = monthCosts.get(key);
-        row.monthCost = acc?.priced ? acc.total : undefined;
-        const summary = result[row.provider];
-        summary.todayCost += row.todayCost ?? 0;
-        summary.monthCost += row.monthCost ?? 0;
-        if (row.monthCost === undefined) {
-            summary.hasUnknownModel = true;
-        }
-        summary.models.push(row);
-    }
+    for (const [key, row] of rows.entries()) {}
     for (const summary of Object.values(result)) {
         summary.models.sort((a, b) => {
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

0 !== 19

[Killed] AssignmentOperator
src/aggregator.ts:86:9
         const acc = monthCosts.get(key);
         row.monthCost = acc?.priced ? acc.total : undefined;
         const summary = result[row.provider];
-        summary.todayCost += row.todayCost ?? 0;
+        summary.todayCost -= row.todayCost ?? 0;
         summary.monthCost += row.monthCost ?? 0;
         if (row.monthCost === undefined) {
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

-19 !== 19

[Killed] AssignmentOperator
src/aggregator.ts:87:9
         row.monthCost = acc?.priced ? acc.total : undefined;
         const summary = result[row.provider];
         summary.todayCost += row.todayCost ?? 0;
-        summary.monthCost += row.monthCost ?? 0;
+        summary.monthCost -= row.monthCost ?? 0;
         if (row.monthCost === undefined) {
             summary.hasUnknownModel = true;
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

-21.5 !== 21.5

[Killed] ConditionalExpression
src/aggregator.ts:88:13
         const summary = result[row.provider];
         summary.todayCost += row.todayCost ?? 0;
         summary.monthCost += row.monthCost ?? 0;
-        if (row.monthCost === undefined) {
+        if (false) {
             summary.hasUnknownModel = true;
         }
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/aggregator.ts:88:42
         const summary = result[row.provider];
         summary.todayCost += row.todayCost ?? 0;
         summary.monthCost += row.monthCost ?? 0;
-        if (row.monthCost === undefined) {
-            summary.hasUnknownModel = true;
-        }
+        if (row.monthCost === undefined) {}
         summary.models.push(row);
     }
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BooleanLiteral
src/aggregator.ts:89:39
         summary.todayCost += row.todayCost ?? 0;
         summary.monthCost += row.monthCost ?? 0;
         if (row.monthCost === undefined) {
-            summary.hasUnknownModel = true;
+            summary.hasUnknownModel = false;
         }
         summary.models.push(row);
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

false !== true

[Killed] BlockStatement
src/aggregator.ts:93:50
         }
         summary.models.push(row);
     }
-    for (const summary of Object.values(result)) {
-        summary.models.sort((a, b) => {
-            const aOrder = defaultPricingOrder(a.model);
-            const bOrder = defaultPricingOrder(b.model);
-            if (aOrder !== undefined && bOrder !== undefined) {
-                return aOrder - bOrder;
-            }
-            if (aOrder !== undefined) {
-                return -1;
-            }
-            if (bOrder !== undefined) {
-                return 1;
-            }
-            return a.model < b.model ? -1 : a.model > b.model ? 1 : 0;
-        });
-    }
+    for (const summary of Object.values(result)) {}
     return result;
 }
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    'gpt-5.6-terra',
    'gpt-5.5',
+   'z-unknown',
    'a-unknown',

[Killed] MethodExpression
src/aggregator.ts:94:9
         summary.models.push(row);
     }
     for (const summary of Object.values(result)) {
-        summary.models.sort((a, b) => {
-            const aOrder = defaultPricingOrder(a.model);
-            const bOrder = defaultPricingOrder(b.model);
-            if (aOrder !== undefined && bOrder !== undefined) {
-                return aOrder - bOrder;
-            }
-            if (aOrder !== undefined) {
-                return -1;
-            }
-            if (bOrder !== undefined) {
-                return 1;
-            }
-            return a.model < b.model ? -1 : a.model > b.model ? 1 : 0;
-        });
+        summary.models;
     }
     return result;
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    'gpt-5.6-terra',
    'gpt-5.5',
+   'z-unknown',
    'a-unknown',

[Killed] BlockStatement
src/aggregator.ts:97:63
         summary.models.sort((a, b) => {
             const aOrder = defaultPricingOrder(a.model);
             const bOrder = defaultPricingOrder(b.model);
-            if (aOrder !== undefined && bOrder !== undefined) {
-                return aOrder - bOrder;
-            }
+            if (aOrder !== undefined && bOrder !== undefined) {}
             if (aOrder !== undefined) {
                 return -1;
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   'gpt-5.5',
    'gpt-5.6-terra',
-   'gpt-5.5',
    'a-unknown',

[Killed] ArithmeticOperator
src/aggregator.ts:98:24
             const aOrder = defaultPricingOrder(a.model);
             const bOrder = defaultPricingOrder(b.model);
             if (aOrder !== undefined && bOrder !== undefined) {
-                return aOrder - bOrder;
+                return aOrder + bOrder;
             }
             if (aOrder !== undefined) {
killedBy: domain quality: requirement-derived examples summary ordering covers known-only, mixed, and both lexical directions
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   'gpt-5.5',
    'gpt-5.6-terra',
-   'gpt-5.5'
  ]

[Killed] BlockStatement
src/aggregator.ts:100:39
             if (aOrder !== undefined && bOrder !== undefined) {
                 return aOrder - bOrder;
             }
-            if (aOrder !== undefined) {
-                return -1;
-            }
+            if (aOrder !== undefined) {}
             if (bOrder !== undefined) {
                 return 1;
killedBy: domain quality: requirement-derived examples summary ordering covers known-only, mixed, and both lexical directions
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   'a-unknown',
    'gpt-5.6-terra',
-   'a-unknown'
  ]

[Killed] ConditionalExpression
src/aggregator.ts:100:17
             if (aOrder !== undefined && bOrder !== undefined) {
                 return aOrder - bOrder;
             }
-            if (aOrder !== undefined) {
+            if (true) {
                 return -1;
             }
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   'a-unknown',
+   'z-unknown',
    'gpt-5.6-terra',
    'gpt-5.5',

[Killed] UnaryOperator
src/aggregator.ts:101:24
                 return aOrder - bOrder;
             }
             if (aOrder !== undefined) {
-                return -1;
+                return +1;
             }
             if (bOrder !== undefined) {
killedBy: domain quality: requirement-derived examples summary ordering covers known-only, mixed, and both lexical directions
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   'a-unknown',
    'gpt-5.6-terra',
-   'a-unknown'
  ]

[Killed] ConditionalExpression
src/aggregator.ts:103:17
             if (aOrder !== undefined) {
                 return -1;
             }
-            if (bOrder !== undefined) {
+            if (false) {
                 return 1;
             }
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
+   'a-unknown',
    'gpt-5.6-terra',
    'gpt-5.5',
-   'a-unknown',

[Killed] ConditionalExpression
src/aggregator.ts:103:17
             if (aOrder !== undefined) {
                 return -1;
             }
-            if (bOrder !== undefined) {
+            if (true) {
                 return 1;
             }
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    'gpt-5.6-terra',
    'gpt-5.5',
+   'z-unknown',
    'a-unknown',

[Killed] EqualityOperator
src/aggregator.ts:106:20
             if (bOrder !== undefined) {
                 return 1;
             }
-            return a.model < b.model ? -1 : a.model > b.model ? 1 : 0;
+            return a.model >= b.model ? -1 : a.model > b.model ? 1 : 0;
         });
     }
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    'gpt-5.6-terra',
    'gpt-5.5',
+   'z-unknown',
    'a-unknown',

[Killed] ConditionalExpression
src/aggregator.ts:106:20
             if (bOrder !== undefined) {
                 return 1;
             }
-            return a.model < b.model ? -1 : a.model > b.model ? 1 : 0;
+            return false ? -1 : a.model > b.model ? 1 : 0;
         });
     }
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  [
    'gpt-5.6-terra',
    'gpt-5.5',
+   'z-unknown',
    'a-unknown',
