[Killed] ArithmeticOperator
src/period.ts:7:22
 export function dayKey(epochMs: number): string {
     const d = new Date(epochMs);
     const y = d.getFullYear();
-    const m = String(d.getMonth() + 1).padStart(2, '0');
+    const m = String(d.getMonth() - 1).padStart(2, '0');
     const day = String(d.getDate()).padStart(2, '0');
     return `${y}-${m}-${day}`;
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

22.5 !== 19

[Killed] MethodExpression
src/period.ts:23:5
 export function startOfMonth(nowMs: number): number {
     const d = new Date(nowMs);
     d.setHours(0, 0, 0, 0);
-    d.setDate(1);
+    d.setTime(1);
     return d.getTime();
 }
killedBy: domain quality: requirement-derived examples calendar examples agree with independently constructed local boundaries
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 1
- 1706713200000
