[Killed] ConditionalExpression
src/pricing.ts:138:9
 /** Newest-first position in the built-in pricing table, including dated IDs. */
 export function defaultPricingOrder(model: string): number | undefined {
     const exact = DEFAULT_PRICING_ORDER.get(model);
-    if (exact !== undefined) {
+    if (true) {
         return exact;
     }
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly equal:

undefined !== 25

[Killed] EqualityOperator
src/pricing.ts:138:9
 /** Newest-first position in the built-in pricing table, including dated IDs. */
 export function defaultPricingOrder(model: string): number | undefined {
     const exact = DEFAULT_PRICING_ORDER.get(model);
-    if (exact !== undefined) {
+    if (exact === undefined) {
         return exact;
     }
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly equal:

undefined !== 25

[Survived] UnaryOperator
src/pricing.ts:142:19
         return exact;
     }
     let bestOrder: number | undefined;
-    let bestLen = -1;
+    let bestLen = +1;
     for (let index = 0; index < DEFAULT_PRICING_KEYS.length; index++) {
         const key = DEFAULT_PRICING_KEYS[index];

[Killed] EqualityOperator
src/pricing.ts:143:25
     }
     let bestOrder: number | undefined;
     let bestLen = -1;
-    for (let index = 0; index < DEFAULT_PRICING_KEYS.length; index++) {
+    for (let index = 0; index >= DEFAULT_PRICING_KEYS.length; index++) {
         const key = DEFAULT_PRICING_KEYS[index];
         if (matches(model, key) && key.length > bestLen) {
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly equal:

undefined !== 25

[Killed] BlockStatement
src/pricing.ts:143:71
     }
     let bestOrder: number | undefined;
     let bestLen = -1;
-    for (let index = 0; index < DEFAULT_PRICING_KEYS.length; index++) {
-        const key = DEFAULT_PRICING_KEYS[index];
-        if (matches(model, key) && key.length > bestLen) {
-            bestOrder = index;
-            bestLen = key.length;
-        }
-    }
+    for (let index = 0; index < DEFAULT_PRICING_KEYS.length; index++) {}
     return bestOrder;
 }
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly equal:

undefined !== 25

[Killed] ConditionalExpression
src/pricing.ts:145:36
     let bestLen = -1;
     for (let index = 0; index < DEFAULT_PRICING_KEYS.length; index++) {
         const key = DEFAULT_PRICING_KEYS[index];
-        if (matches(model, key) && key.length > bestLen) {
+        if (matches(model, key) && true) {
             bestOrder = index;
             bestLen = key.length;
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly equal:

43 !== 25

[Killed] ConditionalExpression
src/pricing.ts:145:13
     let bestLen = -1;
     for (let index = 0; index < DEFAULT_PRICING_KEYS.length; index++) {
         const key = DEFAULT_PRICING_KEYS[index];
-        if (matches(model, key) && key.length > bestLen) {
+        if (true) {
             bestOrder = index;
             bestLen = key.length;
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly equal:

53 !== 25

[Killed] LogicalOperator
src/pricing.ts:163:9
 export function resolvePricing(model: string, overrides?: PricingOverrides, effectiveDay?: string): ModelPricing | undefined {
     const base = lookup(model, DEFAULT_PRICING, effectiveDay, DEFAULT_PRICING_REVISIONS);
     const over = overrides ? lookup(model, overrides, effectiveDay) : undefined;
-    if (!base && !over) {
+    if (!base || !over) {
         return undefined;
     }
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: Expected "actual" to be strictly unequal to:

undefined

[Killed] ConditionalExpression
src/pricing.ts:163:9
 export function resolvePricing(model: string, overrides?: PricingOverrides, effectiveDay?: string): ModelPricing | undefined {
     const base = lookup(model, DEFAULT_PRICING, effectiveDay, DEFAULT_PRICING_REVISIONS);
     const over = overrides ? lookup(model, overrides, effectiveDay) : undefined;
-    if (!base && !over) {
+    if (true) {
         return undefined;
     }
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: Expected "actual" to be strictly unequal to:

undefined

[Survived] ConditionalExpression
src/pricing.ts:175:9
     effectiveDay?: string,
     revisions: Record<string, Array<{ from: string; pricing: Partial<ModelPricing> }>> = {},
 ): Partial<ModelPricing> | undefined {
-    if (table[model]) {
+    if (false) {
         return applyRevisions(model, table[model], effectiveDay, revisions);
     }

[Survived] BlockStatement
src/pricing.ts:175:23
     effectiveDay?: string,
     revisions: Record<string, Array<{ from: string; pricing: Partial<ModelPricing> }>> = {},
 ): Partial<ModelPricing> | undefined {
-    if (table[model]) {
-        return applyRevisions(model, table[model], effectiveDay, revisions);
-    }
+    if (table[model]) {}
     let best: Partial<ModelPricing> | undefined;
     let bestKey: string | undefined;

[Survived] UnaryOperator
src/pricing.ts:180:19
     }
     let best: Partial<ModelPricing> | undefined;
     let bestKey: string | undefined;
-    let bestLen = -1;
+    let bestLen = +1;
     for (const key of Object.keys(table)) {
         if (matches(model, key) && key.length > bestLen) {

[Killed] BlockStatement
src/pricing.ts:181:43
     let best: Partial<ModelPricing> | undefined;
     let bestKey: string | undefined;
     let bestLen = -1;
-    for (const key of Object.keys(table)) {
-        if (matches(model, key) && key.length > bestLen) {
-            best = table[key];
-            bestKey = key;
-            bestLen = key.length;
-        }
-    }
+    for (const key of Object.keys(table)) {}
     return bestKey && best ? applyRevisions(bestKey, best, effectiveDay, revisions) : undefined;
 }
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly equal:

undefined !== 5

[Killed] ConditionalExpression
src/pricing.ts:182:13
     let bestKey: string | undefined;
     let bestLen = -1;
     for (const key of Object.keys(table)) {
-        if (matches(model, key) && key.length > bestLen) {
+        if (false) {
             best = table[key];
             bestKey = key;
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly equal:

undefined !== 5

[Killed] EqualityOperator
src/pricing.ts:182:36
     let bestKey: string | undefined;
     let bestLen = -1;
     for (const key of Object.keys(table)) {
-        if (matches(model, key) && key.length > bestLen) {
+        if (matches(model, key) && key.length <= bestLen) {
             best = table[key];
             bestKey = key;
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly equal:

undefined !== 5

[Killed] BlockStatement
src/pricing.ts:201:50
         return pricing;
     }
     let resolved = pricing;
-    for (const revision of revisions[key] ?? []) {
-        if (effectiveDay >= revision.from) {
-            resolved = { ...resolved, ...revision.pricing };
-        }
-    }
+    for (const revision of revisions[key] ?? []) {}
     return resolved;
 }
killedBy: domain quality: requirement-derived examples revision and long-context boundaries are inclusive/exclusive as required
statusReason: Expected values to be strictly equal:

2.5 !== 2

[Killed] EqualityOperator
src/pricing.ts:202:13
     }
     let resolved = pricing;
     for (const revision of revisions[key] ?? []) {
-        if (effectiveDay >= revision.from) {
+        if (effectiveDay > revision.from) {
             resolved = { ...resolved, ...revision.pricing };
         }
killedBy: domain quality: requirement-derived examples revision and long-context boundaries are inclusive/exclusive as required
statusReason: Expected values to be strictly equal:

2.5 !== 2

[Killed] ConditionalExpression
src/pricing.ts:202:13
     }
     let resolved = pricing;
     for (const revision of revisions[key] ?? []) {
-        if (effectiveDay >= revision.from) {
+        if (true) {
             resolved = { ...resolved, ...revision.pricing };
         }
killedBy: domain quality: requirement-derived examples revision and long-context boundaries are inclusive/exclusive as required
statusReason: Expected values to be strictly equal:

2 !== 2.5

[Killed] MethodExpression
src/pricing.ts:216:9
  * "claude-opus-4-7".
  */
 function matches(model: string, key: string): boolean {
-    if (model.startsWith(key)) {
+    if (model.endsWith(key)) {
         return true;
     }
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly equal:

undefined !== 5

[Killed] BlockStatement
src/pricing.ts:216:32
  * "claude-opus-4-7".
  */
 function matches(model: string, key: string): boolean {
-    if (model.startsWith(key)) {
-        return true;
-    }
+    if (model.startsWith(key)) {}
     return key.endsWith(FAST_SUFFIX) && model.endsWith(FAST_SUFFIX) &&
         model.slice(0, -FAST_SUFFIX.length).startsWith(key.slice(0, -FAST_SUFFIX.length));
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly equal:

undefined !== 5

[Killed] BooleanLiteral
src/pricing.ts:217:16
  */
 function matches(model: string, key: string): boolean {
     if (model.startsWith(key)) {
-        return true;
+        return false;
     }
     return key.endsWith(FAST_SUFFIX) && model.endsWith(FAST_SUFFIX) &&
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly equal:

undefined !== 5

[Killed] ConditionalExpression
src/pricing.ts:219:12
     if (model.startsWith(key)) {
         return true;
     }
-    return key.endsWith(FAST_SUFFIX) && model.endsWith(FAST_SUFFIX) &&
-        model.slice(0, -FAST_SUFFIX.length).startsWith(key.slice(0, -FAST_SUFFIX.length));
+    return true;
 }
 
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 23.65
- undefined

[Killed] ConditionalExpression
src/pricing.ts:219:12
     if (model.startsWith(key)) {
         return true;
     }
-    return key.endsWith(FAST_SUFFIX) && model.endsWith(FAST_SUFFIX) &&
+    return true &&
         model.slice(0, -FAST_SUFFIX.length).startsWith(key.slice(0, -FAST_SUFFIX.length));
 }
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 3.33125
- undefined

[Killed] UnaryOperator
src/pricing.ts:220:24
         return true;
     }
     return key.endsWith(FAST_SUFFIX) && model.endsWith(FAST_SUFFIX) &&
-        model.slice(0, -FAST_SUFFIX.length).startsWith(key.slice(0, -FAST_SUFFIX.length));
+        model.slice(0, +FAST_SUFFIX.length).startsWith(key.slice(0, -FAST_SUFFIX.length));
 }
 
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly equal:

5 !== 30

[Killed] MethodExpression
src/pricing.ts:220:56
         return true;
     }
     return key.endsWith(FAST_SUFFIX) && model.endsWith(FAST_SUFFIX) &&
-        model.slice(0, -FAST_SUFFIX.length).startsWith(key.slice(0, -FAST_SUFFIX.length));
+        model.slice(0, -FAST_SUFFIX.length).startsWith(key);
 }
 
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly equal:

5 !== 30

[Killed] ArithmeticOperator
src/pricing.ts:230:35
     return {
         input: p.input,
         output: p.output,
-        cacheRead: p.cacheRead ?? p.input * 0.1,
+        cacheRead: p.cacheRead ?? p.input / 0.1,
         cacheWrite: p.cacheWrite ?? p.input * 1.25,
         cacheWrite1h: p.cacheWrite1h ?? p.input * 2,
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  {
+   cacheRead: 50,
-   cacheRead: 0.5,
    cacheWrite1h: 10,
    cacheWrite: 6.25,

[Killed] LogicalOperator
src/pricing.ts:230:20
     return {
         input: p.input,
         output: p.output,
-        cacheRead: p.cacheRead ?? p.input * 0.1,
+        cacheRead: p.cacheRead && p.input * 0.1,
         cacheWrite: p.cacheWrite ?? p.input * 1.25,
         cacheWrite1h: p.cacheWrite1h ?? p.input * 2,
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: 5.218 != 5.238

[Killed] LogicalOperator
src/pricing.ts:231:21
         input: p.input,
         output: p.output,
         cacheRead: p.cacheRead ?? p.input * 0.1,
-        cacheWrite: p.cacheWrite ?? p.input * 1.25,
+        cacheWrite: p.cacheWrite && p.input * 1.25,
         cacheWrite1h: p.cacheWrite1h ?? p.input * 2,
         cachedInput: p.cachedInput ?? p.input * 0.1,
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  {
    cacheRead: 0.5,
    cacheWrite1h: 10,
+   cacheWrite: undefined,
-   cacheWrite: 6.25,

[Killed] ArithmeticOperator
src/pricing.ts:231:37
         input: p.input,
         output: p.output,
         cacheRead: p.cacheRead ?? p.input * 0.1,
-        cacheWrite: p.cacheWrite ?? p.input * 1.25,
+        cacheWrite: p.cacheWrite ?? p.input / 1.25,
         cacheWrite1h: p.cacheWrite1h ?? p.input * 2,
         cachedInput: p.cachedInput ?? p.input * 0.1,
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  {
    cacheRead: 0.5,
    cacheWrite1h: 10,
+   cacheWrite: 4,
-   cacheWrite: 6.25,

[Killed] LogicalOperator
src/pricing.ts:232:23
         output: p.output,
         cacheRead: p.cacheRead ?? p.input * 0.1,
         cacheWrite: p.cacheWrite ?? p.input * 1.25,
-        cacheWrite1h: p.cacheWrite1h ?? p.input * 2,
+        cacheWrite1h: p.cacheWrite1h && p.input * 2,
         cachedInput: p.cachedInput ?? p.input * 0.1,
         longContextThreshold: p.longContextThreshold,
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  {
    cacheRead: 0.5,
+   cacheWrite1h: undefined,
-   cacheWrite1h: 10,
    cacheWrite: 6.25,

[Killed] ArithmeticOperator
src/pricing.ts:232:41
         output: p.output,
         cacheRead: p.cacheRead ?? p.input * 0.1,
         cacheWrite: p.cacheWrite ?? p.input * 1.25,
-        cacheWrite1h: p.cacheWrite1h ?? p.input * 2,
+        cacheWrite1h: p.cacheWrite1h ?? p.input / 2,
         cachedInput: p.cachedInput ?? p.input * 0.1,
         longContextThreshold: p.longContextThreshold,
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  {
    cacheRead: 0.5,
+   cacheWrite1h: 2.5,
-   cacheWrite1h: 10,
    cacheWrite: 6.25,

[Killed] LogicalOperator
src/pricing.ts:233:22
         cacheRead: p.cacheRead ?? p.input * 0.1,
         cacheWrite: p.cacheWrite ?? p.input * 1.25,
         cacheWrite1h: p.cacheWrite1h ?? p.input * 2,
-        cachedInput: p.cachedInput ?? p.input * 0.1,
+        cachedInput: p.cachedInput && p.input * 0.1,
         longContextThreshold: p.longContextThreshold,
         longContextInputMultiplier: p.longContextInputMultiplier,
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  {
    cacheRead: 0.2,
    cacheWrite1h: 4,
    cacheWrite: 2.5,
+   cachedInput: undefined,

[Killed] ArithmeticOperator
src/pricing.ts:233:39
         cacheRead: p.cacheRead ?? p.input * 0.1,
         cacheWrite: p.cacheWrite ?? p.input * 1.25,
         cacheWrite1h: p.cacheWrite1h ?? p.input * 2,
-        cachedInput: p.cachedInput ?? p.input * 0.1,
+        cachedInput: p.cachedInput ?? p.input / 0.1,
         longContextThreshold: p.longContextThreshold,
         longContextInputMultiplier: p.longContextInputMultiplier,
killedBy: domain quality: requirement-derived examples exact, dated, fast and incomplete price candidates take each lookup path
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

  {
    cacheRead: 0.2,
    cacheWrite1h: 4,
    cacheWrite: 2.5,
+   cachedInput: 20,

[Killed] EqualityOperator
src/pricing.ts:243:39
 /** Whether one request crosses the model's long-context pricing threshold. */
 export function isLongContextRequest(model: string, inputTokens: number): boolean {
     const threshold = resolvePricing(model)?.longContextThreshold;
-    return threshold !== undefined && inputTokens > threshold;
+    return threshold !== undefined && inputTokens <= threshold;
 }
 
killedBy: domain quality: requirement-derived examples revision and long-context boundaries are inclusive/exclusive as required
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
src/pricing.ts:243:12
 /** Whether one request crosses the model's long-context pricing threshold. */
 export function isLongContextRequest(model: string, inputTokens: number): boolean {
     const threshold = resolvePricing(model)?.longContextThreshold;
-    return threshold !== undefined && inputTokens > threshold;
+    return true;
 }
 
killedBy: domain quality: requirement-derived examples revision and long-context boundaries are inclusive/exclusive as required
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ArithmeticOperator
src/pricing.ts:254:30
     if (!p) {
         return undefined;
     }
-    const longInputPremium = (p.longContextInputMultiplier ?? 1) - 1;
+    const longInputPremium = (p.longContextInputMultiplier ?? 1) + 1;
     const longOutputPremium = (p.longContextOutputMultiplier ?? 1) - 1;
     return (
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: 5.454 != 5.238

[Killed] ArithmeticOperator
src/pricing.ts:255:31
         return undefined;
     }
     const longInputPremium = (p.longContextInputMultiplier ?? 1) - 1;
-    const longOutputPremium = (p.longContextOutputMultiplier ?? 1) - 1;
+    const longOutputPremium = (p.longContextOutputMultiplier ?? 1) + 1;
     return (
         (usage.input * p.input +
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: 5.958 != 5.238

[Killed] ArithmeticOperator
src/pricing.ts:257:10
     const longInputPremium = (p.longContextInputMultiplier ?? 1) - 1;
     const longOutputPremium = (p.longContextOutputMultiplier ?? 1) - 1;
     return (
-        (usage.input * p.input +
+        (usage.input / p.input +
             usage.cachedInput * (p.cachedInput ?? 0) +
             usage.cacheRead * (p.cacheRead ?? 0) +
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: 3.738 != 5.238

[Killed] ArithmeticOperator
src/pricing.ts:257:10
     const longInputPremium = (p.longContextInputMultiplier ?? 1) - 1;
     const longOutputPremium = (p.longContextOutputMultiplier ?? 1) - 1;
     return (
-        (usage.input * p.input +
-            usage.cachedInput * (p.cachedInput ?? 0) +
-            usage.cacheRead * (p.cacheRead ?? 0) +
-            usage.cacheWrite5m * (p.cacheWrite ?? 0) +
+        (usage.input * p.input + usage.cachedInput * (p.cachedInput ?? 0) + usage.cacheRead * (p.cacheRead ?? 0) - usage.cacheWrite5m * (p.cacheWrite ?? 0) +
             usage.cacheWrite1h * (p.cacheWrite1h ?? 0) +
             usage.output * p.output +
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: 3.738 != 5.238

[Killed] ArithmeticOperator
src/pricing.ts:258:13
     const longOutputPremium = (p.longContextOutputMultiplier ?? 1) - 1;
     return (
         (usage.input * p.input +
-            usage.cachedInput * (p.cachedInput ?? 0) +
+            usage.cachedInput / (p.cachedInput ?? 0) +
             usage.cacheRead * (p.cacheRead ?? 0) +
             usage.cacheWrite5m * (p.cacheWrite ?? 0) +
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: 7.638 != 5.238

[Killed] ArithmeticOperator
src/pricing.ts:259:13
     return (
         (usage.input * p.input +
             usage.cachedInput * (p.cachedInput ?? 0) +
-            usage.cacheRead * (p.cacheRead ?? 0) +
+            usage.cacheRead / (p.cacheRead ?? 0) +
             usage.cacheWrite5m * (p.cacheWrite ?? 0) +
             usage.cacheWrite1h * (p.cacheWrite1h ?? 0) +
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: 6.738 != 5.238

[Killed] ArithmeticOperator
src/pricing.ts:260:13
         (usage.input * p.input +
             usage.cachedInput * (p.cachedInput ?? 0) +
             usage.cacheRead * (p.cacheRead ?? 0) +
-            usage.cacheWrite5m * (p.cacheWrite ?? 0) +
+            usage.cacheWrite5m / (p.cacheWrite ?? 0) +
             usage.cacheWrite1h * (p.cacheWrite1h ?? 0) +
             usage.output * p.output +
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: 4.608 != 5.238

[Killed] ArithmeticOperator
src/pricing.ts:261:13
             usage.cachedInput * (p.cachedInput ?? 0) +
             usage.cacheRead * (p.cacheRead ?? 0) +
             usage.cacheWrite5m * (p.cacheWrite ?? 0) +
-            usage.cacheWrite1h * (p.cacheWrite1h ?? 0) +
+            usage.cacheWrite1h / (p.cacheWrite1h ?? 0) +
             usage.output * p.output +
             (usage.longContextInput ?? 0) * p.input * longInputPremium +
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: 4.488 != 5.238

[Killed] ArithmeticOperator
src/pricing.ts:262:13
             usage.cacheRead * (p.cacheRead ?? 0) +
             usage.cacheWrite5m * (p.cacheWrite ?? 0) +
             usage.cacheWrite1h * (p.cacheWrite1h ?? 0) +
-            usage.output * p.output +
+            usage.output / p.output +
             (usage.longContextInput ?? 0) * p.input * longInputPremium +
             (usage.longContextCachedInput ?? 0) * (p.cachedInput ?? 0) * longInputPremium +
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: 4.046333333333333 != 5.238

[Killed] ArithmeticOperator
src/pricing.ts:263:13
             usage.cacheWrite5m * (p.cacheWrite ?? 0) +
             usage.cacheWrite1h * (p.cacheWrite1h ?? 0) +
             usage.output * p.output +
-            (usage.longContextInput ?? 0) * p.input * longInputPremium +
+            (usage.longContextInput ?? 0) * p.input / longInputPremium +
             (usage.longContextCachedInput ?? 0) * (p.cachedInput ?? 0) * longInputPremium +
             (usage.longContextOutput ?? 0) * p.output * longOutputPremium) / M
killedBy: domain quality: deterministic properties cost calculation matches the independent formula and is additive
statusReason: Property "cost-oracle-and-additivity" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\cost-oracle-and-additivity.json
AssertionError [ERR_ASSERTION]: NaN != 0

[Killed] ArithmeticOperator
src/pricing.ts:263:13
             usage.cacheWrite5m * (p.cacheWrite ?? 0) +
             usage.cacheWrite1h * (p.cacheWrite1h ?? 0) +
             usage.output * p.output +
-            (usage.longContextInput ?? 0) * p.input * longInputPremium +
+            (usage.longContextInput ?? 0) / p.input * longInputPremium +
             (usage.longContextCachedInput ?? 0) * (p.cachedInput ?? 0) * longInputPremium +
             (usage.longContextOutput ?? 0) * p.output * longOutputPremium) / M
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: 5.163 != 5.238

[Killed] ArithmeticOperator
src/pricing.ts:264:13
             usage.cacheWrite1h * (p.cacheWrite1h ?? 0) +
             usage.output * p.output +
             (usage.longContextInput ?? 0) * p.input * longInputPremium +
-            (usage.longContextCachedInput ?? 0) * (p.cachedInput ?? 0) * longInputPremium +
+            (usage.longContextCachedInput ?? 0) * (p.cachedInput ?? 0) / longInputPremium +
             (usage.longContextOutput ?? 0) * p.output * longOutputPremium) / M
     );
killedBy: domain quality: deterministic properties cost calculation matches the independent formula and is additive
statusReason: Property "cost-oracle-and-additivity" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\cost-oracle-and-additivity.json
AssertionError [ERR_ASSERTION]: NaN != 0

[Killed] ArithmeticOperator
src/pricing.ts:264:13
             usage.cacheWrite1h * (p.cacheWrite1h ?? 0) +
             usage.output * p.output +
             (usage.longContextInput ?? 0) * p.input * longInputPremium +
-            (usage.longContextCachedInput ?? 0) * (p.cachedInput ?? 0) * longInputPremium +
+            (usage.longContextCachedInput ?? 0) / (p.cachedInput ?? 0) * longInputPremium +
             (usage.longContextOutput ?? 0) * p.output * longOutputPremium) / M
     );
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: 5.43 != 5.238

[Killed] ArithmeticOperator
src/pricing.ts:265:13
             usage.output * p.output +
             (usage.longContextInput ?? 0) * p.input * longInputPremium +
             (usage.longContextCachedInput ?? 0) * (p.cachedInput ?? 0) * longInputPremium +
-            (usage.longContextOutput ?? 0) * p.output * longOutputPremium) / M
+            (usage.longContextOutput ?? 0) * p.output / longOutputPremium) / M
     );
 }
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: 5.778 != 5.238

[Killed] ArithmeticOperator
src/pricing.ts:265:13
             usage.output * p.output +
             (usage.longContextInput ?? 0) * p.input * longInputPremium +
             (usage.longContextCachedInput ?? 0) * (p.cachedInput ?? 0) * longInputPremium +
-            (usage.longContextOutput ?? 0) * p.output * longOutputPremium) / M
+            (usage.longContextOutput ?? 0) / p.output * longOutputPremium) / M
     );
 }
killedBy: domain quality: requirement-derived examples all billing dimensions agree with the independent oracle
statusReason: 5.05925 != 5.238
