[Killed] BlockStatement
src/types.ts:47:72
     };
 }
 
-export function addUsage(target: TokenUsage, source: TokenUsage): void {
-    target.input += source.input;
-    target.cachedInput += source.cachedInput;
-    target.cacheRead += source.cacheRead;
-    target.cacheWrite5m += source.cacheWrite5m;
-    target.cacheWrite1h += source.cacheWrite1h;
-    target.output += source.output;
-    target.longContextInput = (target.longContextInput ?? 0) + (source.longContextInput ?? 0);
-    target.longContextCachedInput = (target.longContextCachedInput ?? 0) + (source.longContextCachedInput ?? 0);
-    target.longContextOutput = (target.longContextOutput ?? 0) + (source.longContextOutput ?? 0);
-}
+export function addUsage(target: TokenUsage, source: TokenUsage): void {}
 
 /** Reverse a prior addUsage so a superseded record's contribution can be replaced. */
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

0 !== 19

[Killed] AssignmentOperator
src/types.ts:48:5
 }
 
 export function addUsage(target: TokenUsage, source: TokenUsage): void {
-    target.input += source.input;
+    target.input -= source.input;
     target.cachedInput += source.cachedInput;
     target.cacheRead += source.cacheRead;
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

2.5 !== 21.5

[Killed] AssignmentOperator
src/types.ts:49:5
 
 export function addUsage(target: TokenUsage, source: TokenUsage): void {
     target.input += source.input;
-    target.cachedInput += source.cachedInput;
+    target.cachedInput -= source.cachedInput;
     target.cacheRead += source.cacheRead;
     target.cacheWrite5m += source.cacheWrite5m;
killedBy: domain quality: deterministic properties usage addition matches the oracle and subtraction reverses it
statusReason: Property "usage-add-subtract" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\usage-add-subtract.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly deep-equal:
+ actual - expected

  {
    cacheRead: 0,
    cacheWrite1h: 0,
    cacheWrite5m: 0,

[Killed] AssignmentOperator
src/types.ts:50:5
 export function addUsage(target: TokenUsage, source: TokenUsage): void {
     target.input += source.input;
     target.cachedInput += source.cachedInput;
-    target.cacheRead += source.cacheRead;
+    target.cacheRead -= source.cacheRead;
     target.cacheWrite5m += source.cacheWrite5m;
     target.cacheWrite1h += source.cacheWrite1h;
killedBy: domain quality: deterministic properties usage addition matches the oracle and subtraction reverses it
statusReason: Property "usage-add-subtract" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\usage-add-subtract.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly deep-equal:
+ actual - expected

  {
+   cacheRead: -1,
-   cacheRead: 1,
    cacheWrite1h: 0,

[Killed] AssignmentOperator
src/types.ts:51:5
     target.input += source.input;
     target.cachedInput += source.cachedInput;
     target.cacheRead += source.cacheRead;
-    target.cacheWrite5m += source.cacheWrite5m;
+    target.cacheWrite5m -= source.cacheWrite5m;
     target.cacheWrite1h += source.cacheWrite1h;
     target.output += source.output;
killedBy: domain quality: deterministic properties usage addition matches the oracle and subtraction reverses it
statusReason: Property "usage-add-subtract" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\usage-add-subtract.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly deep-equal:
+ actual - expected

  {
    cacheRead: 0,
    cacheWrite1h: 0,
+   cacheWrite5m: -1,

[Killed] AssignmentOperator
src/types.ts:52:5
     target.cachedInput += source.cachedInput;
     target.cacheRead += source.cacheRead;
     target.cacheWrite5m += source.cacheWrite5m;
-    target.cacheWrite1h += source.cacheWrite1h;
+    target.cacheWrite1h -= source.cacheWrite1h;
     target.output += source.output;
     target.longContextInput = (target.longContextInput ?? 0) + (source.longContextInput ?? 0);
killedBy: domain quality: deterministic properties usage addition matches the oracle and subtraction reverses it
statusReason: Property "usage-add-subtract" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\usage-add-subtract.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly deep-equal:
+ actual - expected

  {
    cacheRead: 0,
+   cacheWrite1h: -1,
-   cacheWrite1h: 1,

[Killed] AssignmentOperator
src/types.ts:53:5
     target.cacheRead += source.cacheRead;
     target.cacheWrite5m += source.cacheWrite5m;
     target.cacheWrite1h += source.cacheWrite1h;
-    target.output += source.output;
+    target.output -= source.output;
     target.longContextInput = (target.longContextInput ?? 0) + (source.longContextInput ?? 0);
     target.longContextCachedInput = (target.longContextCachedInput ?? 0) + (source.longContextCachedInput ?? 0);
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

-2.5 !== 21.5

[Killed] ArithmeticOperator
src/types.ts:54:31
     target.cacheWrite5m += source.cacheWrite5m;
     target.cacheWrite1h += source.cacheWrite1h;
     target.output += source.output;
-    target.longContextInput = (target.longContextInput ?? 0) + (source.longContextInput ?? 0);
+    target.longContextInput = (target.longContextInput ?? 0) - (source.longContextInput ?? 0);
     target.longContextCachedInput = (target.longContextCachedInput ?? 0) + (source.longContextCachedInput ?? 0);
     target.longContextOutput = (target.longContextOutput ?? 0) + (source.longContextOutput ?? 0);
killedBy: domain quality: deterministic properties usage addition matches the oracle and subtraction reverses it
statusReason: Property "usage-add-subtract" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\usage-add-subtract.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly deep-equal:
+ actual - expected

  {
    cacheRead: 0,
    cacheWrite1h: 0,
    cacheWrite5m: 0,

[Killed] ArithmeticOperator
src/types.ts:55:37
     target.cacheWrite1h += source.cacheWrite1h;
     target.output += source.output;
     target.longContextInput = (target.longContextInput ?? 0) + (source.longContextInput ?? 0);
-    target.longContextCachedInput = (target.longContextCachedInput ?? 0) + (source.longContextCachedInput ?? 0);
+    target.longContextCachedInput = (target.longContextCachedInput ?? 0) - (source.longContextCachedInput ?? 0);
     target.longContextOutput = (target.longContextOutput ?? 0) + (source.longContextOutput ?? 0);
 }
killedBy: domain quality: deterministic properties usage addition matches the oracle and subtraction reverses it
statusReason: Property "usage-add-subtract" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\usage-add-subtract.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly deep-equal:
+ actual - expected

  {
    cacheRead: 0,
    cacheWrite1h: 0,
    cacheWrite5m: 0,

[Killed] ArithmeticOperator
src/types.ts:56:32
     target.output += source.output;
     target.longContextInput = (target.longContextInput ?? 0) + (source.longContextInput ?? 0);
     target.longContextCachedInput = (target.longContextCachedInput ?? 0) + (source.longContextCachedInput ?? 0);
-    target.longContextOutput = (target.longContextOutput ?? 0) + (source.longContextOutput ?? 0);
+    target.longContextOutput = (target.longContextOutput ?? 0) - (source.longContextOutput ?? 0);
 }
 
killedBy: domain quality: deterministic properties usage addition matches the oracle and subtraction reverses it
statusReason: Property "usage-add-subtract" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\usage-add-subtract.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly deep-equal:
+ actual - expected
... Skipped lines

  {
    cacheRead: 0,
    cacheWrite1h: 0,

[Killed] BlockStatement
src/types.ts:60:77
 }
 
 /** Reverse a prior addUsage so a superseded record's contribution can be replaced. */
-export function subtractUsage(target: TokenUsage, source: TokenUsage): void {
-    target.input -= source.input;
-    target.cachedInput -= source.cachedInput;
-    target.cacheRead -= source.cacheRead;
-    target.cacheWrite5m -= source.cacheWrite5m;
-    target.cacheWrite1h -= source.cacheWrite1h;
-    target.output -= source.output;
-    target.longContextInput = (target.longContextInput ?? 0) - (source.longContextInput ?? 0);
-    target.longContextCachedInput = (target.longContextCachedInput ?? 0) - (source.longContextCachedInput ?? 0);
-    target.longContextOutput = (target.longContextOutput ?? 0) - (source.longContextOutput ?? 0);
-}
+export function subtractUsage(target: TokenUsage, source: TokenUsage): void {}
 
 export function totalTokens(u: TokenUsage): number {
killedBy: domain quality: deterministic properties usage addition matches the oracle and subtraction reverses it
statusReason: Property "usage-add-subtract" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\usage-add-subtract.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly deep-equal:
+ actual - expected
... Skipped lines

  {
    cacheRead: 0,
    cacheWrite1h: 0,

[Killed] AssignmentOperator
src/types.ts:61:5
 
 /** Reverse a prior addUsage so a superseded record's contribution can be replaced. */
 export function subtractUsage(target: TokenUsage, source: TokenUsage): void {
-    target.input -= source.input;
+    target.input += source.input;
     target.cachedInput -= source.cachedInput;
     target.cacheRead -= source.cacheRead;
killedBy: domain quality: deterministic properties usage addition matches the oracle and subtraction reverses it
statusReason: Property "usage-add-subtract" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\usage-add-subtract.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly deep-equal:
+ actual - expected

  {
    cacheRead: 0,
    cacheWrite1h: 0,
    cacheWrite5m: 0,

[Killed] AssignmentOperator
src/types.ts:62:5
 /** Reverse a prior addUsage so a superseded record's contribution can be replaced. */
 export function subtractUsage(target: TokenUsage, source: TokenUsage): void {
     target.input -= source.input;
-    target.cachedInput -= source.cachedInput;
+    target.cachedInput += source.cachedInput;
     target.cacheRead -= source.cacheRead;
     target.cacheWrite5m -= source.cacheWrite5m;
killedBy: domain quality: deterministic properties usage addition matches the oracle and subtraction reverses it
statusReason: Property "usage-add-subtract" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\usage-add-subtract.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly deep-equal:
+ actual - expected

  {
    cacheRead: 0,
    cacheWrite1h: 0,
    cacheWrite5m: 0,

[Killed] AssignmentOperator
src/types.ts:63:5
 export function subtractUsage(target: TokenUsage, source: TokenUsage): void {
     target.input -= source.input;
     target.cachedInput -= source.cachedInput;
-    target.cacheRead -= source.cacheRead;
+    target.cacheRead += source.cacheRead;
     target.cacheWrite5m -= source.cacheWrite5m;
     target.cacheWrite1h -= source.cacheWrite1h;
killedBy: domain quality: deterministic properties usage addition matches the oracle and subtraction reverses it
statusReason: Property "usage-add-subtract" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\usage-add-subtract.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly deep-equal:
+ actual - expected

  {
+   cacheRead: 2,
-   cacheRead: 0,
    cacheWrite1h: 0,

[Killed] AssignmentOperator
src/types.ts:64:5
     target.input -= source.input;
     target.cachedInput -= source.cachedInput;
     target.cacheRead -= source.cacheRead;
-    target.cacheWrite5m -= source.cacheWrite5m;
+    target.cacheWrite5m += source.cacheWrite5m;
     target.cacheWrite1h -= source.cacheWrite1h;
     target.output -= source.output;
killedBy: domain quality: deterministic properties usage addition matches the oracle and subtraction reverses it
statusReason: Property "usage-add-subtract" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\usage-add-subtract.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly deep-equal:
+ actual - expected

  {
    cacheRead: 0,
    cacheWrite1h: 0,
+   cacheWrite5m: 2,

[Killed] AssignmentOperator
src/types.ts:65:5
     target.cachedInput -= source.cachedInput;
     target.cacheRead -= source.cacheRead;
     target.cacheWrite5m -= source.cacheWrite5m;
-    target.cacheWrite1h -= source.cacheWrite1h;
+    target.cacheWrite1h += source.cacheWrite1h;
     target.output -= source.output;
     target.longContextInput = (target.longContextInput ?? 0) - (source.longContextInput ?? 0);
killedBy: domain quality: deterministic properties usage addition matches the oracle and subtraction reverses it
statusReason: Property "usage-add-subtract" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\usage-add-subtract.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly deep-equal:
+ actual - expected

  {
    cacheRead: 0,
+   cacheWrite1h: 2,
-   cacheWrite1h: 0,

[Killed] AssignmentOperator
src/types.ts:66:5
     target.cacheRead -= source.cacheRead;
     target.cacheWrite5m -= source.cacheWrite5m;
     target.cacheWrite1h -= source.cacheWrite1h;
-    target.output -= source.output;
+    target.output += source.output;
     target.longContextInput = (target.longContextInput ?? 0) - (source.longContextInput ?? 0);
     target.longContextCachedInput = (target.longContextCachedInput ?? 0) - (source.longContextCachedInput ?? 0);
killedBy: domain quality: deterministic properties usage addition matches the oracle and subtraction reverses it
statusReason: Property "usage-add-subtract" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\usage-add-subtract.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly deep-equal:
+ actual - expected
... Skipped lines

  {
    cacheRead: 0,
    cacheWrite1h: 0,

[Killed] ArithmeticOperator
src/types.ts:67:31
     target.cacheWrite5m -= source.cacheWrite5m;
     target.cacheWrite1h -= source.cacheWrite1h;
     target.output -= source.output;
-    target.longContextInput = (target.longContextInput ?? 0) - (source.longContextInput ?? 0);
+    target.longContextInput = (target.longContextInput ?? 0) + (source.longContextInput ?? 0);
     target.longContextCachedInput = (target.longContextCachedInput ?? 0) - (source.longContextCachedInput ?? 0);
     target.longContextOutput = (target.longContextOutput ?? 0) - (source.longContextOutput ?? 0);
killedBy: domain quality: deterministic properties usage addition matches the oracle and subtraction reverses it
statusReason: Property "usage-add-subtract" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\usage-add-subtract.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly deep-equal:
+ actual - expected

  {
    cacheRead: 0,
    cacheWrite1h: 0,
    cacheWrite5m: 0,

[Killed] ArithmeticOperator
src/types.ts:68:37
     target.cacheWrite1h -= source.cacheWrite1h;
     target.output -= source.output;
     target.longContextInput = (target.longContextInput ?? 0) - (source.longContextInput ?? 0);
-    target.longContextCachedInput = (target.longContextCachedInput ?? 0) - (source.longContextCachedInput ?? 0);
+    target.longContextCachedInput = (target.longContextCachedInput ?? 0) + (source.longContextCachedInput ?? 0);
     target.longContextOutput = (target.longContextOutput ?? 0) - (source.longContextOutput ?? 0);
 }
killedBy: domain quality: deterministic properties usage addition matches the oracle and subtraction reverses it
statusReason: Property "usage-add-subtract" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\usage-add-subtract.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly deep-equal:
+ actual - expected

  {
    cacheRead: 0,
    cacheWrite1h: 0,
    cacheWrite5m: 0,

[Killed] ArithmeticOperator
src/types.ts:69:32
     target.output -= source.output;
     target.longContextInput = (target.longContextInput ?? 0) - (source.longContextInput ?? 0);
     target.longContextCachedInput = (target.longContextCachedInput ?? 0) - (source.longContextCachedInput ?? 0);
-    target.longContextOutput = (target.longContextOutput ?? 0) - (source.longContextOutput ?? 0);
+    target.longContextOutput = (target.longContextOutput ?? 0) + (source.longContextOutput ?? 0);
 }
 
killedBy: domain quality: deterministic properties usage addition matches the oracle and subtraction reverses it
statusReason: Property "usage-add-subtract" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\usage-add-subtract.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly deep-equal:
+ actual - expected
... Skipped lines

  {
    cacheRead: 0,
    cacheWrite1h: 0,

[Killed] ArithmeticOperator
src/types.ts:73:12
 }
 
 export function totalTokens(u: TokenUsage): number {
-    return u.input + u.cachedInput + u.cacheRead + u.cacheWrite5m + u.cacheWrite1h + u.output;
+    return u.input + u.cachedInput + u.cacheRead - u.cacheWrite5m + u.cacheWrite1h + u.output;
 }
 
killedBy: domain quality: deterministic properties display token total excludes long-context classification fields
statusReason: Property "display-total" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\display-total.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly equal:

-1 !== 1

[Killed] ArithmeticOperator
src/types.ts:73:12
 }
 
 export function totalTokens(u: TokenUsage): number {
-    return u.input + u.cachedInput + u.cacheRead + u.cacheWrite5m + u.cacheWrite1h + u.output;
+    return u.input + u.cachedInput - u.cacheRead + u.cacheWrite5m + u.cacheWrite1h + u.output;
 }
 
killedBy: domain quality: deterministic properties display token total excludes long-context classification fields
statusReason: Property "display-total" failed; shrunk evidence saved to C:\Codes\tsuyoshi-otake\otak-usage\.stryker-tmp\sandbox-VIw8rT\domain-quality-evidence\pbt\display-total.json
AssertionError [ERR_ASSERTION]: Expected values to be strictly equal:

-1 !== 1

[Killed] MethodExpression
src/types.ts:82:64
 
 export function parseBucketKey(key: string): { provider: Provider; model: string } {
     const slash = key.indexOf('/');
-    return { provider: key.slice(0, slash) as Provider, model: key.slice(slash + 1) };
+    return { provider: key.slice(0, slash) as Provider, model: key };
 }
 
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

0 !== 19

[Killed] ArithmeticOperator
src/types.ts:82:74
 
 export function parseBucketKey(key: string): { provider: Provider; model: string } {
     const slash = key.indexOf('/');
-    return { provider: key.slice(0, slash) as Provider, model: key.slice(slash + 1) };
+    return { provider: key.slice(0, slash) as Provider, model: key.slice(slash - 1) };
 }
 
killedBy: domain quality: requirement-derived examples aggregation keeps the prune boundary, separates today, and flags unknown models
statusReason: Expected values to be strictly equal:

0 !== 19
